<template>
  <div class="container mt-4 mb-[117px] max-md:mb-10">
    <div class="grid md:grid-cols-2 md:gap-[10%]">
      <h3
        class="leading-[70px] text-primary text-[64px] max-md:text-[28px] font-bold"
      >
        Возврат
      </h3>
      <div>
        <div v-for="(item, index) in datas" :key="index" class="mt-6">
          <p
            class="text-2xl mb-6 max-md:text-[20px] font-semibold text-primary"
          >
            {{ item.title }}
          </p>
          <p
            class="md:text-[20px] leading-[28px] text-primary"
            v-html="item.info"
          ></p>
          <ul
            v-if="item.lists && item.lists.length > 0"
            class="list-disc mt-4 md:text-[20px] leading-[28px] text-[#2F4DA3]"
          >
            <li class="ml-8 leading-[28px]" v-for="(listItem, liIndex) in item.lists" :key="liIndex">
              {{ listItem }}
            </li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref } from "vue";

const datas = ref([
  {
    title: "Обмен и возврат по желанию покупателя",
    info: "Если товар по каким-то причинам не подошел вам, вы имеете право вернуть его или обменять на другой в течение 7 дней* с момента покупки при соблюдении следующих условий: ",
    lists: [
      "Товар имеет первоначальный вид, имеется товарная кондиция;",
      "Товар имеет полную комплектацию, включая упаковочные материалы;",
      "Товар не имеет следов подключался и не имеет признаков монтажа;",
      "Упаковка товара не имеет повреждений, присутствует первоначальный товарный вид;",
      "Есть документ, подтверждающий покупку в нашем интернет-магазине.",
      "Для возврата товара необходимо привезти его к нам в офис.",
      "Товар из других городов можно прислать нам транспортной компанией, при этом услуги транспортной компании  оплачиваются клиентом.",
      "*В течение 14 дней для отдельных брендов. При оформлении заказа уточните у менеджера",
    ],
  },
  {
    title: "Обмен и возврат по ошибке продавца",
    info: "Причины обмена или возврата по ошибке продавца: ",
    lists: [
      "Неполная комплектация товара",
      "Брак или дефект товара",
      "Если вы выявили дефект, брак или неполную комплектацию товара, необходимо сделать фото дефекта и отправить на почту mail@at-svet.ru, указав краткое описание характера брака/",
      "Мы заменим бракованный товар или довезем недостающие части. Доставка будет осуществлена бесплатно",
    ],
  },
  {
    title: "Возврат денежных средств",
    info: "Возврат денежных средств осуществляется путем перевода  на банковские реквизиты покупателя при наличии заявления  от покупателя.",
  },
]);
</script>
